Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: བདེ་གཤེགས་རབ་གསལ་ཚོང་པར་གྱུར་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་འོད་དེ་ལ། །ནོར་བུ་རིན་པོ་ཆེ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pradyota, when a merchant, Offered a precious jewel To the thus-gone Infinite Light And in doing so first gave rise to the mind of unexcelled awakening.

source: དེ་བཞིན་གཤེགས་པ་ཐུབ་པ་དག་གིས་ནི། །དེ་བཞིན་གཤེགས་པ་ཡིད་འཐད་གཟིགས་དེ་ལ། །མུ་ཏིག་དག་ལས་བྱས་པའི་གདུགས་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Muni Offered a parasol made of pearls To the thus-gone Compelling Vision And in doing so first gave rise to the mind of unexcelled awakening.

source: བདེ་གཤེགས་མེ་ཏོག་གྲོང་ཁྱེར་རྟེན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཁ་ལོ་སྒྱུར་དེ་ལ། །ལ་དུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Kusuma, while a city beggar, Offered laḍḍu sweets To the thus-gone Leader And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་གཉིས་པ་ཡིས། །བདེ་གཤེགས་མངོན་པར་འཕགས་པའི་དཔལ་དེ་ལ། །ཚེམས་ཤིང་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The second thus-gone with the name of Kusuma Offered toothsticks To the well-gone Truly Superior Glory And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྤྱན་ལེགས་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལེགས་པར་སྒྲ་སྒྲོགས་ལ། །ཁང་པ་བརྩེགས་པ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sunetra, when a householder, Offered a multistoried mansion To the thus-gone Excellent Speaker And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དེད་དཔོན་དག་གིས་ནི། །དེ་བཞིན་གཤེགས་པ་བདེན་པ་མཐོང་དེ་ལ། །ཙན་དན་དམར་པོའི་ཁྲིའུ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sārthavāha Offered seats of red sandalwood To the thus-gone Seeing the Truth And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལག་ཆེན་རོལ་མོ་མཁན་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཆོག་གྲགས་གྲོང་ཁྱེར་དུ། །བདེ་གཤེགས་དེ་ལ་གླིང་བུས་མཆོད་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahābāhu, when a musician, Offered a flute in the city To the thus-gone Supreme Fame And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྟོབས་ཆེན་སྤོས་འཚོང་བུར་གྱུར་ཚེ། །བདེ་གཤེགས་སེང་བློ་གྲོང་ཁྱེར་གཤེགས་པ་ན། །ཨ་ག་རུ་ཡི་རྡོག་མ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahābala, when the son of an incense merchant, Offered a piece of aloeswood When the well-gone Lion Mind was entering the city And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྒྱུ་སྐར་རྒྱལ་པོ་ཕྱུགས་རྫིའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དབྱངས་བྱིན་དེ་ལ་ནི། །ཁ་ལའི་མེ་ཏོག་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Nakṣatrarāja, when a cattle herder, Offered tāmbūla flowers To the thus-gone Melody Gift And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྩི་སྨན་ཤིང་རྟ་མཁན་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་དྲི་ཞིམ་དེ་ལ་ནི། །ཏིང་ལོ་མར་མེ་བཅས་པ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Oṣadhi, when a chariot maker, Offered a small lamp To the thus-gone Sweet Fragrance And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྙན་པ་ཐ་ག་པར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་མར་མེའི་གློག་འགྱུ་ལ། །རས་ཀྱི་ཁ་ཚར་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Yaśas, when a weaver, Offered woven tassels To the thus-gone Flashing Lamp And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་ཏོག་ཞིང་པར་གྱུར་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་པད་མོའི་འོད་ཟེར་ལ། །མེ་ཏོག་སིལ་མ་དག་གིས་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Ketu, when a farmer, Scattered flower petals Before the thus-gone Radiant Lotus And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་ཆེན་གྲོང་ཁྱེར་རྟེན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྒྲོན་མ་ཆེན་པོ་སྟེ། །དྲང་སྲོང་དེ་ལ་མར་མེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahāprabha, when a city beggar, Offered a lamp To the sage, the thus-gone Great Lamp, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གྲོལ་ཕུང་ལྷམ་མཁན་གྱུར་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབྱངས་དེ་ལ། །མཆིལ་ལྷམ་ཟུང་ཅིག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Muktiskandha, when a cobbler, Offered a set of footwear To the thus-gone Brahmā Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྣམ་སྣང་འཁོར་ལོས་སྒྱུར་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡིད་གཉིས་འཇོམས་དེ་ལ། །ཏ་ལི་བ་ཏི་བརྒྱད་ཁྲི་བཞི་སྟོང་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vairocana, when a universal monarch, Offered eighty-four thousand talibati To the thus-gone Destroyer of Doubt And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཉི་སྙིང་བྲམ་ཟེའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་མཐའ་ཡས་ལ། །ཀོ་ཤ་ཏ་ཀའི་མེ་ཏོག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sūryagarbha, when a brahmin boy, Offered kośātaka flowers To the thus-gone Infinite Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཟླ་བ་གསེར་མགར་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་ཞལ་དེ་ལ། །རིན་པོ་ཆེ་ཡི་སྡོང་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Candra, when a goldsmith’s son, Offered a jeweled staff To the thus-gone Moon Face And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་འཕྲོ་གྲོང་ཁྱེར་རྟེན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་འོད་དེ་ལ། །རྩྭ་ཡི་སྒྲོན་མ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Arciṣmat, when a city beggar, Offered grass torches To the thus-gone Infinite Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་བཟངས་ནགས་ཚལ་སྲུང་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡིད་འོང་གཟི་བརྗིད་ལ། །ཙམ་པ་ཀ་ཡི་མེ་ཏོག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Suprabha, when guarding a forest, Offered campaka flowers To the thus-gone Delightful Splendor And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མྱ་ངན་མེད་པ་ཚོང་དཔོན་བུས། །དེ་བཞིན་གཤེགས་པ་ཡིད་གཉིས་རྣམ་འཇིག་ལ། །ཀར་ནི་ཀ་ཡི་མེ་ཏོག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Aśoka, when the son of a merchant, Offered karṇikā flowers To the thus-gone Destroyer of Doubt And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐར་རྒྱལ་ཁྱིམ་བདག་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་སྒྲོན་དེ་ལ། །ནོར་བུ་རིན་ཆེན་མཆིལ་ལྷམ་ཟུང་ཅིག་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Tiṣya, when the son of a householder, Offered a pair of jeweled footwear To the thus-gone Merit Lamp And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རབ་གསལ་རྒྱ་མཚོའི་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལེགས་པར་མཐོང་དེ་ལ། །ཙན་དན་དམར་པོའི་གཟིམས་ཁྲི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pradyota, when a seafaring merchant, Offered a bed made of red sandalwood To the thus-gone Excellent Sight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཕྲེང་ཐོགས་ཁྱིམ་བདག་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡིད་འོང་གཟི་བརྗིད་ལ། །ཀ་ཀ་ནི་ཡའི་བདུག་སྤོས་གསོལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mālādhārin, when the son of a householder, Offered kakaniya incense To the thus-gone Delightful Splendor And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་འོད་ནི་གསེར་རྟོག་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཚུངས་པ་མེད་དེ་ལ། །མེ་ཏོག་གཅིག་ཅིག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇaprabha, when a gold dealer, Offered a single flower To the thus-gone Incomparable And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དོན་གཟིགས་འཁོར་ལོས་སྒྱུར་རྒྱལ་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་མཛོད་ལ། །ཁང་པ་བརྩེགས་པ་སྟོང་སྙེད་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Arthadarśin, when a universal monarch, Offered a thousand multistoried houses To the thus-gone Treasury of Infinite Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མར་མེ་སྤོས་འབྲུ་མར་འཚོངས་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྣམ་པར་རོལ་པར་སྣང་བ་གང་། །བྱེ་བ་དྲུག་ཅུའི་འཁོར་བཅས་དག་ལ་ཁྲུས་ཁང་གཅིག །ཕུལ་ནས་དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pradīpa, when the son of a dealer in fragrant oils, Offered a bathhouse with sixty million attendants To the thus-gone Playful Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཐུ་ལྡན་གོས་འཚོང་གྱུར་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གྲགས་པ་རྒྱས་དེ་ལ། །རས་བཅོས་ལེབ་ལེབ་ཕོ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Prabhūta, when a garment merchant, Offered rolls of fine cloth To the thus-gone Expansive Fame And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྨན་པ་སྨན་པའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྒྱལ་མཚན་བྲལ་དེ་ལ། །སྤོས་ཀྱི་རི་ལུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vaidya, when a physician’s son, Offered small balls of incense To the thus-gone Without Banner And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དེས་པ་འབྲུ་མར་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་འཕགས་འཇོམས་མཛད་དེ་ལ། །མར་མེ་ཁ་ཅིག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sūrata, when an oil producer, Offered a lamp To the thus-gone Superior Conqueror And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཛོད་སྤུ་ཕྲེང་རྒྱུད་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་གཟིགས་དེ་ལ། །ཨུད་པལ་དམར་པོ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ūrṇa, when a garland maker, Offered red utpalas To the thus-gone Universal Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བརྟན་ལྡན་སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཞན་གྱིས་མི་ཐུབ་དེ་ལ་ནི། །རིན་པོ་ཆེ་ལས་བྱས་པའི་གདན་ཁྲི་གྲངས་བརྒྱད་ཅུ། །རྩ་བཞི་ཕུལ་ནས་དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dṛḍha, when a universal monarch of strength, Offered eighty-four jewel-studded seats To the thus-gone Indomitable And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷ་དཔལ་རྒྱ་མཚོའི་ཚོང་པར་གྱུར་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་ཕུང་པོའི་འོད་དེ་ལ། །ནོར་བུ་རིན་ཆེན་བླ་རེ་དཔག་ཚད་གཅིག་སྣང་བ། །ཕུལ་ནས་དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Śrīdeva, when a seafaring merchant, Offered a canopy of precious jewels that shone for one league To the thus-gone Radiant Mass of Splendor And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གདུལ་དཀའ་ཤིང་འཚོང་གྱུར་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བརྟན་པར་གཤེགས་དེ་ལ། །ཚེམས་ཤིང་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Duṣpradharṣa, when a timber merchant, Offered toothsticks To the thus-gone Steadfast Movement And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་རྒྱལ་མཚན་ཆུའི། །སྦྱིན་བདག་གྱུར་ཚེ་བདེ་གཤེགས་ཡིད་འོང་གྲགས། །དེ་ལ་ཆུ་སྣོད་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Guṇadhvaja, when a water donor, Offered water containers To the well-gone Delightful Fame And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྒྲ་གཅན་ཕྲེང་རྒྱུད་མཁན་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་གཟུགས་དེ་ལ། །གསེར་གྱི་མཆིལ་ལྷམ་ཟུང་ཅིག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Rāhu, when a garland maker’s son, Offered a set of golden footwear To the thus-gone Infinite Form And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚོགས་ཅན་ཁྲུས་པར་གྱུར་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཐུགས་རབ་དང་བ་ལ། །ཁྲུས་ཀྱི་ཆལ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Gaṇin, when a bath attendant, Offered bathing soap To the thus-gone Lucid Heart And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་དབྱངས་ཕྱུགས་རྫིར་གྱུར་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དབྱངས་སྙན་དང་པོར་མངོན་རྫོགས་པར། །སངས་རྒྱས་གྱུར་པའི་ཚེ་ན་དེ་ལ་ཕྱེ་བྲེ་གང་། །ཕུལ་ནས་དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Brahmaghoṣa, when a cattle herder, Offered a full measure of flour To the thus-gone Beautiful Melody upon his awakening, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚིགས་བརྟན་འགྲོན་བུ་འཚོང་བའི་བུར། །གྱུར་ཚེ་བདེ་གཤེགས་མི་གཡོར་གཤེགས་པ་ལ། །འགྲོན་བུ་སྤར་གང་གཏོར་དེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dṛḍhasaṃdhi, when a cowrie-shell merchant’s son, Offered a handful of cowries To the well-gone Gone Immutably upon his awakening, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མི་འགྱིང་རྒྱལ་བུ་དགའ་འདོད་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཀོད་པ་མཐའ་ཡས་ལ། །གླུ་དབྱངས་དག་གིས་མཆོད་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anunnata, when he was prince Joy Wish, Offered songs and music To the thus-gone Infinite Array And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་མཛད་འཁོར་ལོ་སྒྱུར་རྒྱལ་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་བརྩེགས་འོད་ལ། །ན་བཟའ་རིན་པོ་ཆེ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Prabhaṃkara, when a universal monarch, Offered precious garments To the thus-gone Light of Compiled Splendor And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ལྷུན་པོ་ཆེན་པོ་ཡིས། །དེ་བཞིན་གཤེགས་པ་བློ་གནས་དེ་ལ་ནི། །མེ་ཏོག་མྱ་ངན་འཚང་བ་བདུན་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Mahāmeru Offered seven aśoka flowers To the thus-gone Abiding Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྡོ་རྗེ་ལྷ་དབང་བརྒྱ་བྱིན་དུ། །གྱུར་ཚེ་དེ་བཞིན་གཤེགས་པ་བརྟན་པ་ལ། །མེ་ཏོག་མན་དཱ་ར་བའི་ཆར་ཕབ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vajra, when born as Śakra, ruler of the gods, Offered a shower of mandārava flowers To the thus-gone SteadfastAnd in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྡོམ་ཅན་འཛམ་གླིང་གི། །རྒྱལ་པོར་གྱུར་ཚེ་བདེ་གཤེགས་ཐར་དགྱེས་ལ། །གསེར་ལས་བྱས་པའི་བླ་རེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sañjayin, when king of Jambudvīpa, Offered a golden canopy To the well-gone Delighting in Liberation And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མི་བསྙེངས་རོལ་མོ་མཁན་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་མི་འཇིགས་སྦྱིན་དེ་ལ། །རོལ་མོའི་བཀུར་སྟིས་རྔ་ཆེན་བརྡུངས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Nirbhaya, when a musician, Offered musical veneration by beating big drums To the thus-gone Giver of Fearlessness And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་བློ་མཆོག་གྱུར་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདུད་རྩི་མཛོད་དེ་ལ། །སྤོས་ཀྱིས་བསྒོས་པའི་ཕྲེང་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratna, when a chief minister, Offered a garland saturated with incense To the thus-gone Nectar Maker And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་པད་ལྡན་འཁྲུལ་འཁོར་མཁན་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་གཟིགས་དེ་ལ། །ཁྲིའུ་བཟངས་གཅིག་ཅིག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Padmākṣa, when a maker of devices, Offered a fine throne To the thus-gone Universal Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྟོབས་བདེ་རྒྱལ་པོའི་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཞོན་པ་ཆེ་ལྡན་ལ། །སྐྱུ་རུ་ར་ཡི་འབྲས་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Balasena, when a royal physician, Offered a myrobalan fruit To the thus-gone Possessor of the Great Carriage And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མེ་ཏོག་འོད་ཟེར་གསེར་མགར་གྱི། །བུར་གྱུར་ཚེ་ན་བདེ་གཤེགས་ཀུན་གཟིགས་ལ། །རིན་པོ་ཆེ་ཡི་ཕྲེང་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Kusumaraśmi, when the son of a goldsmith, Offered a garland of jewels To the well-gone Universal Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤེས་དགྱེས་བྱིས་པའི་རྒྱན་བྱེད་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡུལ་ཕྱོགས་ཀུན་མཆོད་ལ། །མིག་དང་བདུག་པ་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānapriya, when a maker of ornaments for children, Offered flowers and incense To the thus-gone Worshiped in All Lands And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟི་ཆེན་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་རབ་དཔལ་དེ་ལ། །ན་བཟའི་བླ་རེ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahātejas, when the son of a merchant, Offered a canopy of fine fabrics To the thus-gone Glorious Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚངས་པ་བག་ཆོས་མཁན་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྟོན་པ་བླ་མ་ལ། །ཤ་ཁ་ར་ཡི་རི་ལུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Brahmā, when a cook, Offered a ball of sugar To the thus-gone Highest Teacher And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་དཔག་མེད་པ་གླ་མིའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཀོད་པའི་འོད་དེ་ལ། །གདུགས་གཅིག་ཅིག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amitābha, when a hired laborer, Offered a single parasol To the thus-gone Array of Light And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཀླུ་སྦྱིན་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེ་རྣམ་བསྒྱིངས་ལ། །མེ་ཏོག་དག་གི་ཆུན་པོ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Nāgadatta, when a garland maker, Offered a wreath of flowers To the thus-gone Striding Lion And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བརྟན་གཤེགས་ནོར་བུ་མཁན་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡིད་གཉིས་སྤོང་དེ་ལ། །རིན་པོ་ཆེ་ཡི་དྲ་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dṛḍhakrama, when a jeweler, Offered a jewel net To the thus-gone Abandoning Doubt And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དོན་ཡོད་མཐོང་བ་ནད་པའི་གསོས་སྨན་ལ། །སྦྱོར་མཁན་བུར་གྱུར་ཚེ་ན་དགེ་སློང་དགེ་འདུན་དག །སྤྱན་དྲངས་ནད་སྨན་སྦྱར་ནས་བདེ་གཤེགས་ལེགས་མཐོང་ལ། །དང་པོ་ཁོ་ནར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amoghadarśin, when the son of a medicine maker, Invited the saṅgha of monks and provided medicine To the well-gone Excellent Sight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བརྩོན་འགྲུས་སྦྱིན་པ་འཁོར་ལོས་སྒྱུར་རྒྱལ་ཚེ། །ཙན་དན་དམར་པོ་དག་ལས་གཙུག་ལག་ཁང་བརྒྱ་སྟོང་། །བྱས་ཏེ་རས་བཅོས་གཡོགས་ནས་དེ་བཞིན་གཤེགས་པ་པོ། །བདུད་རྩིའི་སྟབས་ལ་དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vīryadatta, when a universal monarch, Built one hundred thousand temples of red sandalwood And covered them with fine cloth before the thus-gone Nectar Strength And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བཟང་སྐྱོང་གིས་ནི་བདེ་གཤེགས་ཟླ་བའི་འོད། །ཉན་ཐོས་བཅས་པའི་དགེ་འདུན་འཁོར་བཅས་ཁྲི་ཕྲག་བཅུ། །ཞག་བདུན་བར་དུ་ཞལ་ཟས་རོ་ནི་བརྒྱ་ལྡན་པས། །ཚིམ་པར་མཛད་དེ་དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Bhadrapāla Invited the well-gone Moonlight along with one hundred thousand of his saṅgha of hearers, Offering them satisfying food endowed with a hundred tastes for seven days, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དགའ་བོ་རྩལ་ཆེན་བྲམ་ཟེའི་བུར། །གྱུར་ཚེ་དེ་བཞིན་གཤེགས་པ་མཆོག་གྲགས་ལ། །ཡུ་བ་ནོར་བུས་སྤྲས་པའི་རྔ་ཡབ་གཅིག །ཕུལ་ནས་དང་པོར་བྱང་ཆུབ་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Nanda, when the son of a brahmin endowed with great power, Offered a yak-tail fan with a jewel-studded handle To the thus-gone Supreme Fame And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་འཆི་མེད་རྒྱལ་པོ་ཡི། །ཕོ་ཉར་གྱུར་ཚེ་བདེ་གཤེགས་དབང་སྦས་ལ། །པན་ཙ་ལི་ཡི་འབྲས་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Acyuta, when a royal messenger, Offered fruit from Pāñcālī To the well-gone Hidden Faculty And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེའི་རྒྱལ་མཚན་ཞིང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ང་རོ་གསལ་དེ་ལ། །སྐྱུ་རུ་ར་ཡི་འབྲས་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhadhvaja, when a farmer, Offered myrobalan fruit To the thus-gone Clear Roar And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྒྱལ་བ་ཚལ་གྱི་ལས་བྱེད་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཐོགས་མེད་འཁོར་ལོ་ལ། །ཨ་རུ་ར་ཡི་འབྲས་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jaya, when a garden worker, Offered harītakī fruit To the thus-gone Unimpeded Wheel And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ལྡན་དཔའ་བོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་ང་རོ་ལ། །རྒྱལ་མཚན་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Dhārmika, when a hero, Offered banners To the thus-gone Nectar Roar And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཆོག་དགའ་རྒྱལ་པོ་སྤོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་མཆོད་རྟེན་ལ། །ཕྱེ་མ་སྤར་གང་ཕུལ་ཏེ་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Prāmodyarāja, when an incense merchant, Offered and sprinkled handfuls of incense powder Before the thus-gone Stūpa of Wisdom And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཁ་ལོ་སྒྱུར་བ་བྱིས་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་རྫུ་འཕྲུལ་ལ། །པ་ལ་བ་ཏ་གསུམ་ཞིག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sārathi, when a young child, Offered three palabata To the thus-gone Miraculous Display of Splendor And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དགའ་གཤེགས་རྒྱལ་པོའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་རྒྱལ་པོ་ལ། །དངུལ་གྱི་མེ་ཏོག་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Priyaṅgama, when a prince, Offered silver flowers To the thus-gone King of Qualities And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཆུ་ལྷ་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཁ་དོག་དཔག་མེད་ལ། །ལྷུང་བཟེད་སྦྲང་རྩིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Varuṇa, when a merchant, Offered an alms bowl filled with honey To the thus-gone Infinite Colors And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་ལག་ནི་རྩེ་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྟོབས་ཆེན་དེ་ལ་ནི། །འཆག་ས་ཁྲུ་བརྒྱད་ཁོར་ཡུག་བཀྲམ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇabāhu, at the time of play, Constructed a monastic walkway with a perimeter wall eight cubits long For the thus-gone Great Strength And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤོས་གླང་སྤོས་འཚོང་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཀོད་པ་རྣམ་གྲོལ་གྱི། །འཆག་ས་སྤོས་ཀྱི་ཆུ་ཡིས་ཆག་ཆག་བཏབ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Gandhahastin, when the son of an incense merchant, Sprinkled a monastic walkway with fragrant water For the thus-gone Array of Liberation And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྣམ་གཟིགས་གོས་འཚོང་གྱུར་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟིགས་པ་སྒྲིབ་མེད་ལ། །མེ་ཏོག་གི་ནི་གདུགས་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vilocana, when a garment merchant, Offered flower parasols To the thus-gone Unobscured Vision And in doing so first gave rise to the mind of awakening.
